app/controllers/places_controller.rb

  def index
    @places = Place.all
---
SELECT `places`.* FROM `places`

  def show
    @place = Place.find(params[:id])
---
SELECT `places`.* FROM `places` WHERE `places`.`id` = 1 LIMIT 1

  def create
    @place = Place.new(params[:place])

    respond_to do |format|
      if @place.save
---
INSERT INTO `places` (`city`, `created_at`, `name`, `state`, `updated_at`) VALUES ('New York', '2013-04-15 14:24:02', 'Zoo', 'New York', '2013-04-15 14:24:02')